<div class="container">
<h1>Заголовок h1</h1>
<h3>Общепознавательное</h3>
<p>У меня есть вопрос для собеседования на общее развитие, что происходит после ввода http://domain.com/index.php и нажатия enter, вы должны рассказать следующее:</p>
<ul>
<li>откуда и как браузер узнаёт IP адрес сервера</li><li>почему наш запрос будет обрабатывать apache</li><li>почему apache запустит PHP для обработки index.php</li>
<li>каким образом PHP обрабатывает скрипт index.php</li>
</ul>
<blockquote><p>Я таки опять возвращаюсь к собеседованиям, и манит меня прям</p></blockquote>
<p>Из чего состоит HTTP запрос/ответ (да откройте же firebug или что у вас там установлено и посмотрите)<br /> Установка связки Apache+PHP+MySQL &mdash; потренируйтесь, это ой как надо.<br /> Таки немного о linux &mdash; о различиях файловых систем в сравнении с windows, о раздаче прав (chmod) и как выйти из vi без сохранения.</p><p>Отдельно стоит упомянуть о гигиене кода — необходимо соблюдать стандарты кодирования, из множества существующих рекомендую <a href="http://framework.zend.com/manual/ru/coding-standard.html">стандарты кодирования Zend Framework&#8217;а</a>, ну а лучше еще ознакомиться с <a href="https://github.com/php-fig/fig-standards/tree/master/accepted">соответствующими PSR</a></p><p><del>Пару-тройку дней</del> неделя потребуется на усвоение базовых знаний.</p>
